LEXICON = {
    '/start':'Вас приветствует Ш-Маркет!\n\n'
            'Пройдите регистрацию или войдите в аккаунт, чтобы иметь доступ к полному функционалу 🙏',
    'Первичный вход': "Необходимо поделиться вашим номером телефона.\n"
        "Нажмите кнопку ниже под строкой ввода 👇👇👇",
    'Вход после ввода номера': "Введите пароль",
    'Пароль': 'Введите пароль',
    'Нет регистрации': 'К сожалению, вы еще не зарегистрированы\n'
            'Пожалуйста, пройдите регистрацию\n'
            'Напишите слово Регистрация или нажмите кнопку снизу строкой ввода 👇',
    'menu': 'Меню раздела 👇',
    'Неверный пароль': 'Неверный пароль. Попробуйте еще раз',
    'Регистрация после ввода номера': 'Ознакомьтесь с правилами программы и дайте согласие на обработку персональных данных 👇👇👇',
    'Уже зарегистрирован': 'Вы уже зарегистрированы.\n'
            'Для входа в аккаунт нажмите кнопку ниже под строкой ввода 👇👇👇.',
    'Читать': 'СОГЛАСИЕ НА ОБРАБОТКУ ПЕРСОНАЛЬНЫХ ДАННЫХ\n\n'
        'В соответствии с Федеральным законом от 27 июля 2006 года № 152-ФЗ'
        '«О персональных данных», я, свободно,своей волей и в своем интересе даю конкретное,'
        'информированное, сознательное и однозначное согласие боту Sherzod '
        'на обработку следующих персональных данных: '
        'имя, фамилия, номер телефона, история покупок, возраст, город',
    'Ввод имени': 'Введите ваше имя',
    'Некорректное имя': 'Некорректное имя\n'
            '1. Все элементы имени должны быть буквами\n'
            '2. Имя должно содержать не менее двух букв\n'
            'Пожалуйста, введите имя снова',
    'Ввод фамилии': 'Введите вашу фамлию',
    'Некорректная фамилия': 'Некорректная фамилия'
            'Все элементы фамилии должны быть буквами'
            'Фамилия должна содержать не менее двух букв'
            'Пожалуйста, введите фамилию снова',
    'Выбор пола': 'Выберите пол',
    'Ввод даты рождения': 'Введите вашу дату рожденмя 🎂\n'
        'Ваш возраст не может быть меньше 13 лет\n'
        'Формат 30.04.1996',
    'Некорректная дата рождения': 'Введена некорректная дата\n'
            'Пожалуйста, попробуйте еще раз',
    'Меньше 13 лет': 'Регистрация доступна только с 13 лет',
    'Выбор города':'Выберите город 👇',
    'Создание пароля': 'Придумайте и введите пароль или '
        'создайте автоматически по кноке '
        'ниже. Его длина должна быть не менее 6 символов',
    'Пароль создан':  'Ваш пароль успешно создан и сохранен\n'
        'Его можно использовать для входа в Бот '
        'и в Личный кабинет на сайте компании',
    'Согласие на рассылку': 'Я подтверждаю свое согласие на'
        'получение рекламных и иных '
        'информационных сообщений',
    'Неправильный пароль': 'Пароль слишком короткий'
            'Пожалуйста, создайте пароль длинной не менее 6 символов',
    'Регистрация прошла успешно': 'Поздравляем с регистрацией 🤝',
        'Меню': 'Меню раздела 👇',
        'Нет карты': 'Бонусная карта отсутствует ☹️\nДавайте оформим?\n'
                'При регистрации карты мы дарим сразу 250 бонусов на баланс',
        'Нет покупок': 'Вы пока не сделали ни одной покупки в магазине Ш-Маркет ☹️',
        'Обратная связь': 'Выберите тему внизу экрана и оставьте своё обращение 🤔',
        'Качество': 'Напишите Ваше обращение одним сообщением ✍️\n\n'
        'Под сообщение прикрепите ваши контакты (электронный адрес, номер телефона) и укажите предпочтительный способ связи (звонок, письмо), если желаете получить обратную связь по обращению',
        'Отзыв принят': 'Ваше обращение зафиксировано и будет рассмотрено в течении 24 часов с момента оформления.\n\n'}

Loyalty_Program = '''1. Приветственные балы за регистрацию равны 250 баллов;
2. Начисление бонусов происходит в момент совершения операции;
3. Срок сгорания приветственных бонусов - 14 дней после начисления;
4. Срок сгорания бонусов за покупку - 30 дней после начисления;
5. Процент бонусов доступных к списанию должен составлять 30% от стоимости чека.
6. Растущий процент начисления бонусов с диапазонами:
  3% от общей суммы всех покупок менее 5 тыс. руб;
  5% от общей суммы всех покупок менее 10 тыс. руб;
  7% от общей суммы всех покупок более 10 тыс. руб.
7. Бонусы не начисляются/списываются на акционные товары, алкогольную и табачную продукцию, на товары выделенные специальным стоппером;
8. Минимальная сумма чека для списывания баллов равна 100 руб.
9. Минимальная сумма покупки для начисления баллов равна 1 руб.'''
